# Taps
tap 'homebrew/cask-fonts'

# Install ZSH
brew 'fish'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'nvm'
brew 'wget'
brew 'python'
brew 'tmux'
brew 'mas'
brew 'starship'

# Apps
cask '1password'
cask 'docker'
cask 'hiddenbar'
cask 'raycast'
cask 'rectangle-pro'
cask 'visual-studio-code'
cask 'alt-tab'
cask 'iterm2'
cask 'spotify'
cask 'discord'
cask 'microsoft-edge'
cask 'yippy'
cask '1password/tap/1password-cli'

# Fonts
cask 'font-fira-code'

# Mac App Store
mas 'spark', id: 1176895641
