# Taps
tap 'homebrew/cask-fonts'

# Install ZSH
brew 'fish'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'node'
brew 'wget'
brew 'python'
brew 'tmux'
brew 'mas'

# Apps
cask '1password-beta'
cask 'docker'
cask 'hiddenbar'
cask 'raycast'
cask 'visual-studio-code'
cask 'alt-tab'
cask 'iterm2'
cask 'spotify'
cask 'discord'
cask 'gitkraken'
cask 'microsoft-edge'
cask 'plex'
cask 'yippy'

# Fonts
cask 'font-fira-code'


# Mac App Store
mas 'magnet', id: 441258766
