# Taps
tap 'homebrew/cask-fonts'
tap 'felixkratz/formulae'

# Install ZSH
brew 'fish'

# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'

# Install Binaries
brew 'git'
brew 'hub'
brew 'tree'
brew 'mackup'
brew 'nvm'
brew 'wget'
brew 'python'
brew 'tmux'
brew 'mas'
brew 'starship'
brew 'thefuck'
brew 'fzf'
brew 'fd'
brew 'bat'
brew 'zoxide'
brew 'borders', restart_service: true
brew 'sketchybar', restart_service: true

# Apps
cask '1password'
cask 'docker'
cask 'raycast'
cask 'visual-studio-code'
cask 'alt-tab'
cask 'iterm2'
cask 'spotify'
cask 'discord'
cask 'arc'
cask 'microsoft-outlook'
cask '1password/tap/1password-cli'
cask 'notion'
cask 'nikitabobko/tap/aerospace'
# cask 'hiddenbar'
# cask 'hiddenbar'

# Fonts
cask 'font-fira-code'
cask 'font-jetbrains-mono-nerd-font'